{"s-nail":"Mail processing system with a command syntax reminiscent of ed","sdparm":"An utility similar to hdparm but for SCSI devices","sed":"GNU stream editor","shadow":"Password and account management tool suite with support for shadow files and PAM","sqlite":"A C library that implements an SQL database engine","sqlite-analyzer":"An analysis program for sqlite3 database files","sqlite-doc":"most of the static HTML files that comprise this website, including all of the SQL Syntax and the C\/C++ interface specs and other miscellaneous documentation","sqlite-tcl":"sqlite Tcl Extension Architecture (TEA)","sudo":"Give certain users the ability to run some commands as root","sysfsutils":"System Utilities Based on Sysfs","syslinux":"Collection of boot loaders that boot from FAT, ext2\/3\/4 and btrfs filesystems, from CDs and via PXE","systemd":"system and service manager","systemd-sysvcompat":"sysvinit compat for systemd","samba":"SMB Fileserver and AD Domain server","sane":"Scanner Access Now Easy","sane-frontends":"A set of frontends for SANE.","sbc":"Bluetooth Subband Codec (SBC) library","sbcl":"Steel Bank Common Lisp","sbsigntools":"Tools to add signatures to EFI binaries and Drivers","sbsms":"Library for time stretching and pitch scaling of audio","schroedinger":"An implemenation of the Dirac video codec in ANSI C code","scim":"Input method user interface and development platform","scim-anthy":"Japanese input method module for SCIM","scim-chewing":"Traditional Chinese input method module for SCIM","scim-hangul":"Korean input method module for SCIM","scim-m17n":"Multilingual input method module for SCIM","scim-pinyin":"Chinese pinyin input for SCIM","scim-tables":"Generic table input method module for SCIM","scim-uim":"UIM bridging input engine for SCIM","scons":"Extensible Python-based build utility","scour":"An SVG scrubber","screen":"Full-screen window manager that multiplexes a physical terminal","sddm":"QML based X11 and Wayland display manager","sddm-kcm":"KDE Config Module for SDDM","sdl":"A library for portable low-level access to a video framebuffer, audio output, mouse, and keyboard","sdl2":"A library for portable low-level access to a video framebuffer, audio output, mouse, and keyboard (Version 2)","sdl2_gfx":"SDL graphics drawing primitives and other support functions (Version 2)","sdl2_image":"A simple library to load images of various formats as SDL surfaces (Version 2)","sdl2_mixer":"A simple multi-channel audio mixer (Version 2)","sdl2_net":"A small sample cross-platform networking library (Version 2)","sdl2_ttf":"A library that allows you to use TrueType fonts in your SDL applications (Version 2)","sdl_gfx":"SDL graphics drawing primitives and other support functions","sdl_image":"A simple library to load images of various formats as SDL surfaces","sdl_mixer":"A simple multi-channel audio mixer","sdl_net":"A small sample cross-platform networking library","sdl_pango":"Pango SDL binding","sdl_sound":"A library to decode several popular sound file formats, such as .WAV and .MP3","sdl_ttf":"A library that allows you to use TrueType fonts in your SDL applications","seabios":"A 16-bit x86 bios","seahorse":"GNOME application for managing PGP keys.","seahorse-nautilus":"PGP encryption and signing for nautilus","serf":"High-performance asynchronous HTTP client library","sg3_utils":"Generic SCSI utilities","sgml-common":"Tools for maintaining centralized SGML catalogs.","shared-color-targets":"Shared color targets for creating color profiles","shared-mime-info":"Freedesktop.org Shared MIME Info","sharutils":"Makes so-called shell archives out of many files","signon-kwallet-extension":"KWallet integration for signon framework","signon-plugin-oauth2":"OAuth 2 plugin for signon","signon-ui":"UI component responsible for handling the user interactions which can happen during the login process of an online account","signond":"A D-Bus service which performs user authentication on behalf of its clients","sip":"A tool that makes it easy to create Python bindings for C and C++ libraries","slang":"S-Lang is a powerful interpreted language","slim":"Desktop-independent graphical login manager for X11","slim-themes":"Themes Pack for Simple Login Manager","smartmontools":"Control and monitor S.M.A.R.T. enabled ATA and SCSI Hard Drives","smbclient":"Tools to access a server's filespace and printers via SMB","smpeg":"SDL MPEG Player Library","snappy":"A fast compressor\/decompressor library","snarf":"Command-line URL retrieval tool (http\/ftp\/gopher)","sni-qt":"Qt4 plugin which turns all QSystemTrayIcon into StatusNotifierItems (appindicators)","snowball":"String processing language for creating stemming algorithms","socat":"Multipurpose relay","solid":"Hardware integration and detection","sonata":"Elegant GTK+ music client for MPD","sonnet":"Spelling framework for Qt5","sound-juicer":"A lean and friendly audio CD extractor for GNOME","sound-theme-freedesktop":"Freedesktop sound theme","soundtouch":"An audio processing library","source-highlight":"Convert source code to syntax highlighted document","spamassassin":"A mail filter to identify spam.","spandsp":"A DSP library for telephony","spectacle":"KDE screenshot capture utility","speech-dispatcher":"High-level device independent layer for speech synthesis interface","speex":"A free codec for free speech","speexdsp":"DSP library derived from Speex","spglib":"C library for finding and handling crystal symmetries","spice":"SPICE server","spice-protocol":"Headers for SPICE protocol","spirv-tools":"API and commands for processing SPIR-V modules","srt":"Secure Reliable Transport library","startup-notification":"Monitor and display application startup","stellarium":"A stellarium with great graphics and a nice database of sky-objects","step":"Interactive Physical Simulator","strace":"A diagnostic, debugging and instructional userspace tracer","streamripper":"Records and splits streaming mp3 into tracks","subversion":"A Modern Concurrent Version Control System","suitesparse":"A collection of sparse matrix libraries","sushi":"A quick previewer for Nautilus","svgpart":"A KPart for viewing SVGs","sweeper":"System Cleaner","swell-foop":"Clear the screen by removing groups of colored and shaped tiles","swig":"Generate scripting interfaces to C\/C++ code","swt":"An open source widget toolkit for Java","syntax-highlighting":"Syntax highlighting engine for structured text and code","syslog-ng":"Next-generation syslogd with advanced networking and filtering capabilities","sysprof":"Kernel based performance profiler","system-config-printer":"A CUPS printer configuration tool and status applet","systemsettings":"KDE system settings","smlnj":"Standard ML compiler from New Jersey","sopcast":"The Streaming Direct Broadcast System based on P2P","steam":"Valve's digital software delivery system","steam-native-runtime":"Native replacement for the Steam runtime","s3cmd":"A command line client for Amazon S3","s3fs-fuse":"FUSE-based file system backed by Amazon S3","sage-data-combinatorial_designs":"Data for Combinatorial Designs","sage-data-conway_polynomials":"A small database of Conway polynomials","sage-data-elliptic_curves":"Database of elliptic curves for SageMath","sage-data-graphs":"A database of graphs for Sage","sage-data-polytopes_db":"Reflexive polytopes database","sage-notebook":"Browser-based notebook interface for SageMath","sage-notebook-exporter":"Jupyter extension to export notebooks from SageNB","sagemath":"Open Source Mathematics Software, free alternative to Magma, Maple, Mathematica, and Matlab","sagemath-doc":"HTML documentation and inline help for SageMath","sagemath-jupyter":"Jupyter kernel for SageMath","sagetex":"Allows to embed code, results of computations, and plots from SageMath into LaTeX documents","sakura":"A terminal emulator based on GTK and VTE","salt":"Central system and configuration manager","samplv1":"Polyphonic sampler synthesizer with stereo fx","sane-gt68xx-firmware":"gt68xx-based scanners firmwares","sarg":"Squid Analysis Report Generator","sassc":"C implementation of Sass CSS preprocessor.","sasteroids":"SDL Asteroids","sauerbraten":"FPS that uses an improved version of the Cube engine","sauerbraten-data":"Improved version of the Cube engine - datas files","savage-dri":"Mesa DRI drivers for S3 Sraphics\/VIA Savage","sbt":"The interactive build tool","sbxkb":"Simple tray XKB indicator","sc":"Ncurses-based spreadsheet program","sc3-plugins":"Extension plugins for the SuperCollider3 audio synthesis server.","scala":"A Java-interoperable language with object-oriented and functional features","scala-docs":"Scala documentation","scala-sources":"Scala sources","scanmem":"Memory scanner designed to isolate the address of an arbitrary variable in an executing process","scantailor":"Interactive post-processing tool for scanned pages","scapy":"Powerful interactive packet manipulation program written in Python (tools)","scapy3k":"Powerful interactive packet manipulation program (based on scapy) written in Python","schedtool":"Query or alter a process' scheduling policy","schroot":"Allows users to execute shell commands under different root filesystems. (Successor to dchroot).","scp":"Lightweight application for copying files over SSH","scponly":"A limited shell for ssh\/scp","scrapy":"A fast high-level scraping and web crawling framework.","scratch":"Create and share your own interactive stories, games, music and art","scratch-text-editor":"The Pantheon Text Editor","screenfetch":"CLI Bash script to show system\/theme info in screenshots","screenlets":"Widget framework that consists of small owner-drawn applications","screenlets-pack-basic":"Desktop widgets for Screenlets","scribes":"An ultra minimalist text editor that combines simplicity with power","scribus":"Desktop publishing software","scrot":"Simple command-line screenshot utility for X","scrypt":"key derivation function and encryption utility","scummvm":"A 'virtual machine' for several classic graphical point-and-click adventure games.","scummvm-tools":"A set of tools that enable you to convert, compress and decode game datafiles for ScummVM","sdcv":"StarDict Console Version","seamonkey":"SeaMonkey internet suite","semi":"A library to provide MIME feature for GNU Emacs.","semver":"The semantic version parser used by npm.","sensors-applet":"Applet for GNOME Panel to display readings from hardware sensors, including CPU temperature, fan speeds and voltage readings","ser2net":"A proxy that allows telnet\/tcp connections to be made to serial ports","serd":"A lightweight C library for RDF syntax which supports reading and writing Turtle and NTriples.","setconf":"Utility for easily changing settings in configuration files","sfml":"A simple, fast, cross-platform, and object-oriented multimedia API","sgmltools-lite":"SGML processing tools (sucessor to the obsolete SGMLtools)","shadowsocks":"A lightweight tunnel proxy","shadowsocks-libev":"A lightweight secured socks5 proxy for embedded devices and low end boxes","shadowsocks-qt5":"A fast, reliable and cross-platform GUI fronted for Shadowsocks.","shairplay":"Apple airplay and raop protocol server","shairport-sync":"Emulates an AirPort Express for the purpose of streaming music from iTunes and compatible iPods and iPhones","shake":"Userspace defragmenter that can be run while system is in use","shapelib":"Simple C API for reading and writing ESRI Shapefiles","shards":"The package manager for the Crystal language","shared_meataxe":"A set of programs for working with matrix representations over finite fields","shedskin":"Python to C++ compiler","shellcheck":"Shell script analysis tool","sherlock.lv2":"An investigative plugin bundle","shfs-utils":"SHell FileSystem Linux utils","shhmsg":"Library for displaying messages","shhopt":"Library for parsing command line options","shiboken":"CPython bindings generator for C++ libraries","shntool":"A multi-purpose WAVE data processing and reporting utility","shorewall":"An iptables-based firewall for Linux systems","shorewall-core":"Core Shorewall libraries","shorewall6":"An iptables-based firewall for Linux systems (with IPv6 support)","shotwell":"A digital photo organizer designed for the GNOME desktop environment","shuffle":"Shuffles lines of input.","siege":"An http regression testing and benchmarking utility","sigil":"WYSIWYG ebook editor","signify":"OpenBSD tool to signs and verify signatures on files","simavr":"A lean, mean and hackable AVR simulator","simh":"simulator for assorted historical computers, from Altair to VAX","simple-obfs":"A simple obfusacting tool designed as plugin server of shadowsocks","simple-scan":"Simple scanning utility","simplescreenrecorder":"A feature-rich screen recorder that supports X11 and OpenGL.","simutrans":"An open source transportation simulation game","simutrans-pak128":"High resolution graphics set for Simutrans","simutrans-pak64":"Low resolution graphics set for Simutrans","singular":"Computer Algebra System for polynomial computations","singularity":"Strategy game - simulation of true AI","sink":"An offline-caching, synchronization and indexing system for PIM data","sipcalc":"an advanced console based ip subnet calculator.","sirocco":"C++ library that allows to compute piecewise linear approximations of the path followed by the root of a complex polynomial","sis-dri":"Mesa DRI drivers for SiS","sk1":"Professional quality illustration program","skanlite":"Image Scanning Application for KDE","skia-sharp":"The Skia 2D Graphics library from Google exposed to .NET languages and runtimes across the board","skia-sharp58":"The Skia 2D Graphics library from Google exposed to .NET languages and runtimes across the board","skk-jisyo":"Dictionaries for the SKK Japanese input method","skktools":"Dictionary maintenance tools for the SKK Japanese input method","skopeo":"A command line utility for various operations on container images and image repositories.","skrooge":"A personal finances manager for KDE","sl":"Steam Locomotive runs across your terminal when you type \"sl\" as you meant to type \"ls\".","sleuthkit":"File system and media management forensic analysis tools","slib":"Library of functions for Scheme implementations","slimevolley":"A simple yet fun arcade volley game","sloccount":"Tools for counting physical source lines of code","slock":"A simple screen locker for X","slop":"Utility to query the user for a selection and print the region to stdout","slowhttptest":"Highly configurable tool that simulates some Application Layer Denial of Service (DoS) attacks","smali":"Assembler\/disassembler for Android's dex format","smalltalk":"GNU Smalltalk interpreter and libraries","smb4k":"A KDE program that browses samba shares","smbnetfs":"small C program that mounts Microsoft network neighborhood in single directory.","smem":"Generate reports on memory usage.","smokeping":"A tool to keep track of your network latency","smplayer":"Media player with built-in codecs that can play virtually all video and audio formats","smplayer-skins":"Skins for SMPlayer","smplayer-themes":"Themes for SMPlayer","smtube":"A small youtube browser","smuxi":"User-friendly and cross-platform IRC client for sophisticated users for GNOME\/GTK+ (frontend)","smuxi-server":"User-friendly and cross-platform IRC client for sophisticated users for GNOME\/GTK+ (common files and server)","snap-pac":"Pacman hooks that use snapper to create pre\/post btrfs snapshots like openSUSE's YaST","snap-sync":"Use snapper snapshots to backup to external drive","snapper":"A tool for managing BTRFS and LVM snapshots. It can create, diff and restore snapshots and provides timelined auto-snapping.","snappy-player":"Powerful media player with a minimalistic interface","snd":"An advanced sound editor","sndio":"A small audio and MIDI framework part of the OpenBSD project","snes9x":"A portable Emulator for the Super Nintendo Entertainment System","snes9x-gtk":"A portable Emulator for the Super Nintendo Entertainment System - GTK version","sniffglue":"Secure multithreaded packet sniffer","sniffit":"Very good packet sniffer for unix with ncurses interactive mode","soil":"A tiny C lib primarily for loading textures into OpenGL","solfege":"Music education and ear training software","solidity":"Contract-Oriented Programming Language","sonic-visualiser":"A viewer and analyser of music audio files.","sopel":"An easy-to-use and highly extensible IRC Bot framework (Formerly Willie)","sorcer":"A polyphonic wavetable synth LV2 plugin","sord":"A lightweight C library for storing RDF data in memory","soundconverter":"A simple sound converter application for GNOME","soundfont-fluid":"FluidR3 soundfont","soundkonverter":"Front-end to various audio converters","sox":"The Swiss Army knife of sound processing tools","spambayes":"Bayesian anti-spam classifier written in Python","spampd":"Spamassassin Proxy Daemon","sparkleshare":"Collaboration and sharing tool based on git written in C Sharp","sparsehash":"Library that contains several hash-map implementations, including implementations that optimize for space or speed.","spatialindex":"Extensible framework that supports robust spatial indexing methods and sophisticated spatial queries","spawn-fcgi":"A FastCGI process manager for web applications","speakup-utils":"Tiny utilities for controlling the Speakup screenreader","spectmorph":"A free software project which allows to analyze samples of musical instruments, and to combine them (morphing)","spectrwm":"A minimalistic automatic tiling window manager that tries to stay out of the way.","speed-dreams":"A racing simulator with rich graphics and physics","speed-dreams-data":"A racing simulator with rich graphics and physics (data files)","speedcrunch":"Simple but powerful calculator using Qt","speedtest-cli":"Command line interface for testing internet bandwidth using speedtest.net","spice-gtk":"GTK+ client library for SPICE","spice-vdagent":"Spice agent for Linux guests","splint":"A tool for statically checking C programs for security vulnerabilities and coding mistakes","splix":"CUPS drivers for SPL (Samsung Printer Language) printers","spring":"A free 3D real-time-strategy (RTS) game engine","springlobby":"A free cross-platform lobby client for the Spring RTS project","spyder2":"Scientific PYthon Development EnviRonment providing MATLAB-like features for Python 2.x series.","spyder3":"Scientific PYthon Development EnviRonment providing MATLAB-like features for Python 3.x series.","sqlcipher":"SQLite extension that provides transparent 256-bit AES encryption of database files","sqlitebrowser":"SQLite Database browser is a light GUI editor for SQLite databases, built on top of Qt","sqlmap":"Automatic SQL injection and database takeover tool","squashfs-tools":"Tools for squashfs, a highly compressed read-only filesystem for Linux.","squeak-vm":"Full-featured implementation of the Smalltalk programming language and environment","squid":"Full-featured Web proxy cache server","sratom":"An LV2 Atom RDF serialisation library","ssdeep":"A program for computing context triggered piecewise hashes","sshfs":"FUSE client based on the SSH File Transfer Protocol","sshguard":"Brute force detector for SSH, Exim, VSFTPD and more. Blocks by ip with iptables","sshpass":"Fool ssh into accepting an interactive password non-interactively","sshuttle":"Transparent proxy server that forwards all TCP packets over ssh","sslh":"SSL\/SSH\/OpenVPN\/XMPP\/tinc port multiplexer","sslscan":"A fast tools to scan SSL services, such as HTTPS to determine the ciphers that are supported","sslsplit":"Tool for man-in-the-middle attacks against SSL\/TLS encrypted network connections","sslstrip":"Python tool to hijack HTTPS connections during a MITM attack","ssmtp":"Extremely simple MTA to get mail off the system to a mailhub","sssd":"System Security Services Daemon","stack":"The Haskell Tool Stack","stalonetray":"STAnd-aLONE sysTRAY. It has minimal build and run-time dependencies: the Xlib only.","stardict":"International dictionary software","startdde":"starter of deepin desktop environment","steadyflow":"Simple download manager for GNOME","steghide":"Embeds a message in a file by replacing some of the least significant bits","stella":"Atari 2600 VCS emulator","stfl":"Library implementing a curses-based widget set for text terminals","sthttpd":"Supported fork of the thttpd web server","stk":"The Synthesis ToolKit in C++","stlink":"Firmware programmer for STM32 STLINK v1\/v2 protocol","stone-soup":"Open-source, single-player, role-playing roguelike game of exploration and treasure-hunting","stow":"Manage installation of multiple softwares in the same directory tree","streamlink":"CLI program that launches streams from various streaming services in a custom video player (livestreamer fork)","stress":"A tool that stress tests your system (CPU, memory, I\/O, disks)","strip-nondeterminism":"Tool for stripping bits of non-deterministic information from files","strongswan":"open source IPsec implementation","stubby":"DNS Privacy stub resolver","stunnel":"A program that allows you to encrypt arbitrary TCP connections inside SSL","stylish-haskell":"Haskell code prettifier","stylus":"Robust, expressive, and feature-rich CSS superset","subbrute":"A DNS meta-query spider that enumerates DNS records and subdomains","subdl":"A command-line tool for downloading subtitles from opensubtitles.org","subdownloader":"Automatic download\/upload of subtitles using fast hashing","subsurface":"Divelog program","subsurface-libdc":"Library for communication with dive computers","subtitleeditor":"A GTK+3 tool to edit subtitles for GNU\/Linux\/*BSD","sugar":"Sugar GTK shell","sugar-activity-browse":"Sugar activity to browse the internet","sugar-activity-calculate":"Graphing calculator for Sugar","sugar-activity-chat":"Sugar activity for text chatting","sugar-activity-clock":"Clock for Sugar","sugar-activity-imageviewer":"Image viewer for Sugar","sugar-activity-jukebox":"Media player for Sugar","sugar-activity-log":"Sugar activity to view system log files","sugar-activity-paint":"Sugar activity to create paintings or drawings","sugar-activity-pippy":"Sugar activity to learn and develop in Python programming language","sugar-activity-read":"Sugar activity to read books","sugar-activity-terminal":"Terminal emulator for Sugar","sugar-activity-write":"Sugar activity to edit texts","sugar-artwork":"Sugar icons and themes","sugar-datastore":"Sugar datastore service","sugar-runner":"Scripts to run Sugar","sugar-toolkit-gtk3":"Sugar GTK library","suil":"A lightweight C library for loading and wrapping LV2 plugin UIs","sunpinyin":"Statistical Language Model based pinyin IME by Sun","sunpinyin-data":"Statistical language model data from open-gram project for sunpinyin","sunxi-tools":"A collection of command line tools for ARM devices with Allwinner SoCs","supercollider":"Environment and programming language for real time audio synthesis and algorithmic composition","supertux":"A classic 2D jump'n'run sidescroller game in a style similar to the original SuperMario games","supertuxkart":"Kart racing game featuring Tux and his friends","supervisor":"A system for controlling process state under UNIX","surf":"A simple web browser based on WebKit\/GTK+.","surfraw":"Shell Users' Revolutionary Front Rage Against the Web","svgcleaner":"An application that cleans svg images from unnecessary data in batch mode.","swaks":"Swiss Army Knife SMTP; Command line SMTP testing, including TLS and AUTH","sway":"i3 compatible window manager for Wayland","sweep":"Sound editing and mixing program","sweethome3d":"An interior design application to draw the plan of your house in a 3D environment","swh-plugins":"Steve Harris' LADSPA plug-ins suite","swi-prolog":"Prolog environment","sword":"Library for Bible study programs","sx":"Simple alternative to startx(1) for starting an Xorg server.","sxhkd":"Simple X hotkey daemon","sxiv":"Simple X Image Viewer","sylpheed":"Lightweight and user-friendly e-mail client","symmetrica":"Algorithms for symmetric groups and classical groups","sympow":"A a package to compute special values of symmetric power elliptic curve L-functions","synapse":"A semantic file launcher","synbak":"Meant to unify several backup methods in a single application while supplying a powerful reporting system","syncthing":"Open Source Continuous Replication \/ Cluster Synchronization Thing","syncthing-gtk":"GTK3 based GUI and notification area icon for Syncthing","syncthing-relaysrv":"Relay server for Syncthing","synergy":"Share a single mouse and keyboard between multiple computers","synthv1":"An old-school all-digital 4-oscillator subtractive polyphonic synthesizer with stereo fx","sysdig":"Open source system-level exploration and troubleshooting tool","sysstat":"a collection of performance monitoring tools (iostat,isag,mpstat,pidstat,sadf,sar)","systemd-swap":"Script for creating hybrid swap space from zram swaps, swap files and swap partitions.","systemd-ui":"Graphical front-end for systemd","systemdgenie":"Systemd management utility","sysvbanner":"System-V banner clone","sonic-pi":"The Live Coding Music Synth for Everyone"}