{"iana-etc":"\/etc\/protocols and \/etc\/services provided by IANA","icu":"International Components for Unicode library","inetutils":"A collection of common network programs","iproute2":"IP Routing Utilities","iptables":"Linux kernel packet control tool (using legacy interface)","iptables-nft":"Linux kernel packet control tool (using nft interface)","iputils":"Network monitoring tools, including ping","ipw2100-fw":"Intel Centrino Drivers firmware for IPW2100","ipw2200-fw":"Firmware for the Intel PRO\/Wireless 2200BG","iw":"nl80211 based CLI configuration utility for wireless devices","iagno":"Dominate the board in a classic version of Reversi","ibus":"Next Generation Input Bus for Linux","ibus-typing-booster":"Predictive input method for the IBus platform","icedtea-web":"Additional components for OpenJDK - Browser plug-in and Web Start implementation","icedtea-web-doc":"Additional components for OpenJDK - Browser plug-in and Web Start implementation (documentation)","icon-naming-utils":"Maps the new names of icons for Tango to the legacy names used by the GNOME and KDE desktops.","id3lib":"Library for reading, writing, and manipulating ID3v1 and ID3v2 tags","ifplugd":"A daemon which brings up\/down network interfaces upon cable insertion\/removal.","ijs":"a library which implements a protocol for transmission of raster page images","imagemagick":"An image viewing\/manipulation program","imagemagick-doc":"An image viewing\/manipulation program (manual and API docs)","imake":"X.Org imake program and related utilities","imap":"An IMAP\/POP server","imath":"A C++ and python library of 2D and 3D vector, matrix, and math operations for computer graphics","imlib2":"Library that does image file loading and saving as well as rendering, manipulation, arbitrary polygon support","incidenceeditor":"KDE PIM incidence editor","iniparser":"A free stand-alone ini file parsing library written in portable ANSI C","inkscape":"Professional vector graphics editor","intel-ucode":"Microcode update files for Intel CPUs","intltool":"The internationalization tool collection","ipp-usb":"allows using the IPP protocol, normally designed for network printers, to be used with USB printers as well","ipset":"Administration tool for IP sets","iptraf-ng":"Console-based network monitoring utility","irqbalance":"IRQ balancing daemon for SMP systems","irssi":"Modular text mode IRC client with Perl scripting","iso-codes":"Lists of the country, language, and currency names","ispell":"An interactive spell-checking program for Unix","itinerary":"Itinerary and boarding pass management application","itstool":"XML to PO and back again","iucode-tool":"Tool to manipulate Intel® IA-32\/X86-64 microcode bundles","i2c-tools":"Heterogeneous set of I2C tools for Linux that used to be part of lm-sensors","i2pd":"A full-featured C++ implementation of the I2P router","i3-gaps":"A fork of i3wm tiling window manager with more features, including gaps","i3-wm":"Improved dynamic tiling window manager","i3blocks":"Define blocks for your i3bar status line","i3lock":"Improved screenlocker based upon XCB and PAM","i3status":"Generates status bar to use with i3bar, dzen2 or xmobar","i3status-rust":"Resourcefriendly and feature-rich replacement for i3status, written in pure Rust","i7z":"A better i7 (and now i3, i5) reporting tool for Linux","i810-dri":"Mesa DRI drivers for Intel i810","iaito":"Qt and C++ GUI for radare2 reverse engineering framework","ibm-sw-tpm2":"Implementation of the TCG Trusted Platform Module 2.0 specification","ibus-anthy":"Japanese input method Anthy IMEngine for IBus Framework","ibus-chewing":"Chinese Chewing Engine for IBus Framework","ibus-hangul":"Korean input engine for IBus","ibus-kkc":"libkkc (Japanese Kana Kanji input method) engine for ibus","ibus-libpinyin":"Intelligent Pinyin engine based on libpinyin for IBus","ibus-m17n":"M17N engine for IBus","ibus-pinyin":"Pinyin (Chinese) input method for the IBus framework","ibus-rime":"Rime input method engine for ibus","ibus-skk":"Japanese input method SKK engine for IBus","ibus-sunpinyin":"IBus Wrapper for sunpinyin","ibus-table":"IM Engine framework for table-based input methods, such as ZhengMa, WuBi, ErBi, CangJie and so on","ibus-table-chinese":"Some table-based input method of tables engines for IBus","ibus-table-extraphrase":"The extra phrases of tables engines for IBus","ibus-unikey":"IBus module for Vietnamese Keyboard","icecast":"Streaming audio over the Internet","icewm":"Window Manager designed for speed, usability, and consistency","icmake":"A program maintenance (make) utility using a C-like grammar","icoutils":"Extracts and converts images in MS Windows(R) icon and cursor files.","id3v2":"Utility to edit id3v2 tags","iddawc":"OAuth2 and OIDC client library","idle3-tools":"A utility that can disable, get and set the value of the idle3 timer found on Western Digital Hard Drives.","idris":"Functional Programming Language with Dependent Types","iec16022":"Produce 2D barcodes often also referenced as DataMatrix","iempluginsuite":"Plug-in suite including Ambisonic plug-ins up to 7th order","iftop":"Display bandwidth usage on an interface","ifuse":"A fuse filesystem to access the contents of an iPhone or iPod Touch","igmpproxy":"a simple multicast router for Linux only using the IGMP protocol","igraph":"A library for creating and manipulating (un)directed graphs","igsc":"Intel graphics system controller firmware update library","iio-sensor-proxy":"IIO accelerometer sensor to input device proxy","imagescan":"EPSON Image Scan v3 front-end for scanners and all-in-ones","imapsync":"IMAP synchronisation, sync, copy or migration tool","img2pdf":"Losslessly convert raster images to PDF","iml":"C Library of integer matrix algorithms","imlib":"General image handling library for X11 and Gtk","impacket":"Collection of classes for working with network protocols","imv":"Image viewer for Wayland and X11","imvirt":"Detect the virtualization technology of a machine, it is run in","imwheel":"Mouse wheel configuration tool for XFree86\/Xorg","in-toto":"A framework to secure your software supply chain","inadyn":"Dynamic DNS client with SSL\/TLS support","incron":"Like the regular cron but is driven by filesystem events instead of time periods","indent":"C language source code formatting program","index-fm":"Multi-platform file manager","indicator-china-weather":"Indicator that displays China weather information","infamousplugins":"A collection of open-source LV2 plugins","influx-cli":"CLI for managing resources in InfluxDB","influxdb":"Scalable datastore for metrics, events, and real-time analytics","inn":"Complete open source Usenet system. De facto standard for handling news routing, news spool and serving the spool to customers.","innernet":"A private network system that uses WireGuard under the hood","innoextract":"A tool to extract installers created by Inno Setup","inotify-tools":"inotify-tools is a C library and a set of command-line programs for Linux providing a simple interface to inotify.","inspectrum":"Tool for analysing captured signals, primarily from software-defined radio receivers","intel-compute-runtime":"Intel(R) Graphics Compute Runtime for oneAPI Level Zero and OpenCL(TM) Driver","intel-gmmlib":"Intel Graphics Memory Management Library","intel-gpu-tools":"Tools for development and testing of the Intel DRM driver","intel-graphics-compiler":"Intel Graphics Compiler for OpenCL","intel-media-driver":"Intel Media Driver for VAAPI — Broadwell+ iGPUs","intel-media-sdk":"API to access hardware-accelerated video on Intel Gen graphics hardware platforms","intel-metee":"Access library for Intel CSME HECI interface","intel-metee-doc":"Access library for Intel CSME HECI interface (documentation)","intel-mkl":"Intel Math Kernel Library","intel-mkl-static":"Intel Math Kernel Library (static libraries)","intel-opencl-clang":"Wrapper library around clang that can compile OpenCL C kernels to SPIR-V modules","intel-undervolt":"Intel CPU undervolting tool","intellij-idea-community-edition":"IDE for Java, Groovy and other programming languages with advanced refactoring features","inter-font":"A typeface specially designed for user interfaces","interception-caps2esc":"Interception plugin that transforms the most useless key ever in the most useful one","interception-dual-function-keys":"Interception plugin for dual-function keys: Tap for one key, hold for another","interception-tools":"A minimal composable infrastructure on top of libudev and libevdev","io":"IO programming language","iodine":"Tunnel IPv4 data through a DNS server","ioping":"Simple disk I\/0 latency measuring tool","iotop":"View I\/O usage of processes","ipcalc":"Calculates IP broadcast, network, Cisco wildcard mask, and host ranges","iperf":"A tool to measure maximum TCP bandwidth","iperf3":"TCP, UDP, and SCTP network bandwidth measurement tool","ipguard":"ipguard - arp<->ip relation checking tool","ipmitool":"Command-line interface to IPMI-enabled devices","iptstate":"top-like interface to netfilter connection-tracking table","iptux":"LAN messenger and file sender, an IP Messenger client","ipv6calc":"Small utility to manipulate, convert and calculate (more than) IPv6 addresses","ipvsadm":"The IP Virtual Server administration utility","ipxe":"Network bootloader","ipython":"An enhanced Interactive Python shell.","ir.lv2":"No-latency\/low-latency, realtime, high performance signal convolver for reverb effects","irker":"An IRC client that runs as a daemon accepting notification requests","irrlicht":"An open source high performance realtime 3D graphics engine.","irrlicht-docs":"An open source high performance realtime 3D graphics engine.","irssi-xmpp":"irssi plugin to connect to the Jabber network","isatapd":"Creates and maintains an ISATAP tunnel (rfc5214) in Linux","isomd5sum":"Utilities for working with md5sum implanted in ISO images","ispc":"Compiler for high-performance SIMD programming on the CPU","ispin":"New Tcl\/Tk GUI for Spin replacing xSpin","istio":"Istio configuration command line utility for service operators to debug and diagnose their Istio mesh.","isync":"IMAP and MailDir mailbox synchronizer","iverilog":"Icarus Verilog compiler and simulation tool","ivy":"Agile dependency manager","iwd":"Internet Wireless Daemon"}