{"readline":"GNU readline library","reiserfsprogs":"Reiserfs utilities","rpcbind":"portmap replacement which supports RPC over various protocols","run-parts":"run scripts or programs in a directory","r":"Language and environment for statistical computing and graphics","raptor":"A C library that parses RDF\/XML\/N-Triples into RDF triples","rasqal":"A library handling RDF query syntaxes, construction and execution","rav1e":"An AV1 encoder focused on speed and safety","razor":"A distributed, collaborative, spam detection and filtering network","rcs":"Revision Control System: manages multiple revisions of files","re2":"Fast, safe, thread-friendly regular expression engine","re2c":"A tool for generating C-based recognizers from regular expressions","rebuilderd-website":"Arch Linux Rebuilderd website reproducible.archlinux.org","recode":"Converts files between various character sets and usages","redland":"Library that provides a high-level interface to RDF data","redland-storage-mysql":"MySQL storage support for Redland","redland-storage-postgresql":"PostgreSQL storage support for Redland","redland-storage-sqlite":"SQLite storage support for Redland","redland-storage-virtuoso":"Virtuoso storage support for Redland","refind":"An EFI boot manager","rest":"Helper library for RESTful services","rhash":"Utility for verifying hash sums of files","rhino":"Open-source implementation of JavaScript written entirely in Java","rhythmbox":"Music playback and management application","rinutils":"C11 \/ gnu11 utilities C library","ristretto":"A fast and lightweight picture viewer for Xfce","rocs":"Graph Theory IDE","rp-pppoe":"Roaring Penguin's Point-to-Point Protocol over Ethernet client","rpcsvc-proto":"rpcsvc protocol definitions from glibc","rpmextract":"Script to convert or extract RPM archives (contains rpm2cpio)","rrdtool":"Data logging and graphing application","rsync":"A fast and versatile file copying tool for remote and local files","rtkit":"Realtime Policy and Watchdog Daemon","rtmpdump":"Tool to download rtmp streams","rttr":"C++ Reflection Library","ruby":"An object-oriented language for quick and easy programming","ruby-docs":"Documentation files for ruby","rubygems":"Package management framework for Ruby","rust":"Systems programming language focused on safety, speed and concurrency","rust-docs":"Documentation for the Rust programming language","rust-musl":"Musl target for Rust","rygel":"UPnP AV MediaServer and MediaRenderer","r10k":"Provides a general purpose toolset for deploying Puppet environments and modules.","r128-dri":"Mesa DRI drivers for ATI Rage128","r2ghidra":"Deep ghidra decompiler integration for radare2 and iaito","r8168":"A kernel module for Realtek 8168 network cards","r8168-lts":"A kernel module for Realtek 8168 network cards for linux-lts","rabbitmq":"Highly reliable and performant enterprise messaging implementation of AMQP written in Erlang\/OTP","rabbitmqadmin":"Command-line tool for managing RabbitMQ server (requires \"management\" plugin)","racket":"A full-spectrum language with DrRacket IDE. Formerly known as PLT Scheme.","racket-minimal":"Minimal Racket installation, without DrRacket\/docs.","radamsa":"General purpose mutation based fuzzer","radare2":"Open-source tools to disasm, debug, analyze and manipulate binary files","radcli":"Client library for writing Radius clients in C or C++","radeontool":"Lowlevel tools to tweak register and dump state on radeon GPUs","radeontop":"View GPU utilization for total activity percent and individual blocks","radicale":"Simple calendar (CalDAV) and contact (CardDAV) server","radvd":"IPv6 Router Advertisement Daemon","raft":"C implementation of the Raft consensus protocol","ragel":"Compiles finite state machines from regular languages into executable C, C++, Objective-C, or D code.","range-v3":"Experimental range library for C++11\/14\/17","ranger":"Simple, vim-like file manager","rankwidth":"A program that calculates rank-width and rank-decompositions","rapid-photo-downloader":"Photo and video downloader","rapidjson":"Fast JSON parser\/generator for C++ with both SAX\/DOM style API","rapydscript-ng":"Pythonic JavaScript that doesn't suck","ratpoints":"A program that uses an optimized quadratic sieve algorithm in order to find rational points on hyperelliptic curves","ratpoison":"A simple keystroke-driven window manager","raw-thumbnailer":"A lightweight and fast raw image thumbnailer that can be used by file managers.","rawdog":"RSS Aggregator Without Delusions Of Grandeur","rawtherapee":"A powerful cross-platform raw image processing program","raylib":"Simple and easy-to-use game programming library","razercfg":"Razer mouse configuration tool","rbutil":"Rockbox Utility","rbw":"Unofficial Bitwarden CLI","rclone":"Sync files to and from Google Drive, S3, Swift, Cloudfiles, Dropbox and Google Cloud Storage","rdesktop":"An open source client for Windows Remote Desktop Services","rdiff-backup":"A utility for local\/remote mirroring and incremental backups.","react-native-debugger":"The standalone app for React Native Debugger, with React DevTools \/ Redux DevTools","reactphysics3d":"Physics engine","reactphysics3d-docs":"Physics engine (user manual)","read-edid":"Program that can get information from a PNP monitor","realtime-privileges":"Realtime privileges for users","reaver":"Brute force attack against Wifi Protected Setup","rebar":"A sophisticated build-tool for Erlang projects that follows OTP principles.","rebuild-detector":"Detects which packages need to be rebuilt","rebuilderd":"Independent verification system of binary packages","recoll":"Full text search tool based on Xapian backend","recordmydesktop":"Produces a OGG encapsulated Theora\/Vorbis recording of your desktop","redis":"An in-memory database that persists on disk","redmine":"A flexible project management web application written using Ruby on Rails framework.","rednotebook":"Modern desktop diary and personal journaling tool that lets you format, tag and search your entries","redshift":"Adjusts the color temperature of your screen according to your surroundings.","referenceassemblies-pcl":"Microsoft .NET Portable Library Reference Assemblies","reflector":"A Python 3 module and script to retrieve and filter the latest Pacman mirror list.","regexxer":"Interactive search and replace tool for GNOME","rekor":"Signature Transparency Log -- Sigstore client and server tools","release-cli":"Gitlab Release CLI","remake":"Enhanced GNU Make - tracing, error reporting, debugging, profiling and more","remind":"A sophisticated calendar and alarm program.","remmina":"remote desktop client written in GTK+","renameutils":"A set of programs designed to make renaming of files faster and less cumbersome","renpy":"The Ren'Py Visual Novel Engine","renpy-demos":"The Ren'Py Visual Novel Engine","repo":"The Multiple Git Repository Tool from the Android Open Source Project","repose":"Arch Linux repo building tool","reprepro":"Debian package repository producer","reprotest":"Run a process twice and check the output for reproducibility","reptyr":"Utility for taking an existing running program and attaching it to a new terminal","restic":"Fast, secure, efficient backup program","restinio":"Header-only C++14 library that gives you an embedded HTTP\/Websocket server","retext":"A simple editor for Markdown and ReStructuredText markup languages","retro-gtk":"Toolkit to write GTK+ 3 based Libretro frontends","retroarch":"Reference frontend for the libretro API","retroarch-assets-glui":"XMB menu assets for RetroArch","retroarch-assets-ozone":"XMB menu assets for RetroArch","retroarch-assets-xmb":"XMB menu assets for RetroArch","reuse":"Helper tool for providing and confirming copyright and licensing information","rev-plugins":"LADSPA stereo and ambisonic reverb plugin based on zita-rev1","revive":"faster, stricter, configurable, extensible, and beautiful drop-in replacement for golint","rfc":"RFCs from rfc-editor.org","rfdump":"Tool to detect RFID-Tags and show their meta information","rgbds":"Rednex GameBoy Development System","rhit":"A nginx log explorer","rhonabwy":"JWK, JWKS, JWS, JWE and JWT C library","rime-bopomofo":"Bopomofo input for rime","rime-cangjie":"Cangjie input for rime","rime-cantonese":"Cantonese input for rime","rime-double-pinyin":"double-pinyin input for rime","rime-emoji":"Emoji support for rime","rime-essay":"Essential files for building up your Rime configuration","rime-loengfan":"Cantonese version of Liang Fen input method","rime-luna-pinyin":"Luna pinyin for rime","rime-pinyin-simp":"Simple pinyin input for rime","rime-pinyin-zhwiki":"Fcitx 5 Pinyin Dictionary from zh.wikipedia.org","rime-prelude":"Essential files for building up your Rime configuration","rime-quick":"Quick input for rime","rime-stroke":"Stroke input for rime","rime-terra-pinyin":"Terra pinyin for rime","rime-wubi":"Wubi input for rime","rime-wugniu":"Wugniu input for rime","rink":"Unit conversion tool and library written in rust","ripgrep":"A search tool that combines the usability of ag with the raw speed of grep","riscv32-elf-binutils":"A set of programs to assemble and manipulate binary and object files for the RISCV32 (bare-metal) target","riscv32-elf-gdb":"The GNU Debugger for the RISCV32 (bare-metal) target","riscv32-elf-newlib":"A C standard library implementation intended for use on embedded systems (RISCV32 bare metal)","riscv64-elf-binutils":"A set of programs to assemble and manipulate binary and object files for the RISCV64 (bare-metal) target","riscv64-elf-gcc":"The GNU Compiler Collection - cross compiler for RISCV64 (bare-metal) target","riscv64-elf-gdb":"The GNU Debugger for the RISCV64 (bare-metal) target","riscv64-elf-newlib":"A C standard library implementation intended for use on embedded systems (RISCV64 bare metal)","riscv64-linux-gnu-binutils":"Assemble and manipulate binary and object files for 32-bit and 64-bit RISC-V","riscv64-linux-gnu-gcc":"Cross compiler for 32-bit and 64-bit RISC-V","riscv64-linux-gnu-gdb":"The GNU Debugger for the 32bit and 64bit RISC-V target","riscv64-linux-gnu-glibc":"GNU C Library RISCV target","riscv64-linux-gnu-linux-api-headers":"Kernel headers sanitized for use in userspace (riscv64-linux-gnu)","rizin":"Open-source tools to disasm, debug, analyze and manipulate binary files","rkcommon":"Intel RenderKit common C++\/CMake infrastructure","rkhunter":"Checks machines for the presence of rootkits and other unwanted tools.","rkward":"An easy to use and easily extensible IDE\/GUI for R","rlog":"A flexible message logging facility for C++ programs and libraries","rlwrap":"Adds readline-style editing and history to programs.","rmlint":"Tool to remove duplicates and other lint, being much faster than fdupes","rmlint-shredder":"Graphical user interface for rmlint","rng-tools":"Random number generator related utilities","rnnoise":"A noise suppression library based on a recurrent neural network","robin-map":"C++ implementation of a fast hash map and hash set using robin hood hashing","robotfindskitten":"Yet another Zen simulation","rocksdb":"Embedded key-value store for fast storage","rocksndiamonds":"game similiar to Boulderdash with lots of levels","rocksndiamonds-data":"rockndiamonds game data and levels","rofi":"A window switcher, application launcher and dmenu replacement","rofi-calc":"Do calculations in rofi","rofi-emoji":"A Rofi plugin for selecting emojis","rofi-pass":"bash script to handle pass storages in a convenient way","rofimoji":"Character picker for rofi","rogue":"The original dungeon crawl game.","root":"C++ data analysis framework and interpreter from CERN","root-cuda":"C++ data analysis framework and interpreter from CERN with GPU (CUDA) features enabled","ropgadget":"Search gadgets in binaries to facilitate ROP exploitation for several file formats and architectures","ropper":"Show information about binary files and find gadgets to build rop chains for different architectures","rosegarden":"MIDI\/audio sequencer and notation editor","roundcubemail":"A PHP web-based mail client","routersploit":"Open-source exploitation framework dedicated to embedded devices","routino":"Router for OpenStreetMap Data","rox":"A small and fast file manager which can optionally manage the desktop background and panels","rpg-cli":"Your filesystem as a dungeon!","rpm-tools":"RPM Package Manager - RPM.org fork, used in major RPM distros","rshijack":"TCP connection hijacker, rust rewrite of shijack","rsibreak":"Takes care of your health and regularly breaks your work to avoid repetitive strain injury (RSI)","rsnapshot":"A remote filesystem snapshot utility","rspamd":"Fast, free and open-source spam filtering system","rssguard":"Simple (yet powerful) Qt5 feed reader","rssguard-nowebengine":"Simple (yet powerful) Qt5 feed reader without WebEngine support","rst2pdf":"Use a text editor. Make a PDF","rstcheck":"Checks syntax of reStructuredText and code blocks nested within it","rt-tests":"A collection of latency testing tools for the linux(-rt) kernel","rtaudio":"A set of C++ classes that provide a common API for realtime audio input\/output.","rtirq":"Realtime IRQ thread system tuning.","rtl-sdr":"Driver for Realtek RTL2832U, allowing general purpose software defined radio (SDR).","rtmidi":"A set of C++ classes that provides a common API for realtime MIDI input\/output.","rtorrent":"Ncurses BitTorrent client based on libTorrent","rtosc":"Realtime safe OSC Messaging","rubber":"A wrapper for LaTeX and friends","rubberband":"Time-stretching and pitch-shifting audio library and utility","rubiks":"Several programs for working with Rubik's cubes","ruby-activesupport":"A collection of utility classes and standard library extensions","ruby-addressable":"URI Implementation","ruby-async":"Composable asynchronous I\/O","ruby-async-dns":"Asynchronous DNS resolver and server","ruby-async-io":"Provides support for asynchonous TCP, UDP, UNIX and SSL sockets","ruby-atk":"Ruby\/ATK is a Ruby binding of ATK-1.0.x.","ruby-augeas":"Provides Ruby bindings for augeas","ruby-bcrypt_pbkdf":"OpenBSD's bcrypt_pdkfd (a variant of PBKDF2 with bcrypt-based PRF)","ruby-builder":"Provide a simple way to create XML markup and data structures","ruby-bundler":"Manages an application's dependencies through its entire life, across many machines, systematically and repeatably.","ruby-cairo":"Ruby bindings for cairo","ruby-cairo-gobject":"Ruby\/CairoGObject is a Ruby binding of cairo-gobject","ruby-chronic":"Natural language date\/time parser written in pure Ruby","ruby-colorator":"Colorize your text in the terminal","ruby-colored2":"Simple gem that adds various colour methods to String class","ruby-colorize":"Ruby string class extension to set color, background and text effect using ANSI escape sequences","ruby-concurrent":"Modern concurrency tools including agents, futures, promises, thread pools, actors, supervisors, and more.","ruby-crack":"Really simple JSON and XML parsing, ripped from Merb and Rails.","ruby-cri":"Library for building easy-to-use command-line tools with support for nested commands","ruby-daemons":"Easy way to wrap existing ruby scripts to be run as a daemon","ruby-dbus":"Ruby module for interaction with D-Bus","ruby-deep_merge":"Recursively merge Ruby hashes","ruby-diff-lcs":"Diff::LCS computes the difference between two Enumerable sequences using the McIlroy-Hunt longest common subsequence (LCS) algorithm","ruby-domain_name":"Domain Name manipulation library for Ruby","ruby-ed25519":"A Ruby binding to the Ed25519 elliptic curve public-key signature system described in RFC 8032.","ruby-em-proxy":"EventMachine Proxy DSL for writing high-performance transparent \/ intercepting proxies","ruby-eventmachine":"EventMachine: fast, simple event-processing library","ruby-fakeweb":"Ruby test helper for injecting fake responses to web requests","ruby-faraday":"HTTP\/REST API client library.","ruby-faraday-em_http":"About Faraday adapter for EventMachine::HttpRequest","ruby-faraday-em_synchrony":"Faraday adapter for EM::Synchrony","ruby-faraday-excon":"Faraday adapter for Excon","ruby-faraday-httpclient":"Faraday adapter for HTTPClient","ruby-faraday-middleware":"Various middleware for Faraday","ruby-faraday-net_http":"Faraday adapter for Net::HTTP","ruby-faraday-net_http_persistent":"About Faraday adapter for NetHttpPersistent","ruby-faraday-patron":"About Faraday adapter for Patron","ruby-faraday-rack":"About Faraday adapter for Rack","ruby-fast_gettext":"A simple, fast, memory-efficient and threadsafe implementation of GetText","ruby-ffi":"Ruby FFI","ruby-forwardable-extended":"Extends forwardable with delegation to hashes and instance variables","ruby-gdk3":"Ruby\/GDK3 is a Ruby binding of GDK-3.x.","ruby-gdk_pixbuf2":"Ruby\/GdkPixbuf2 is a Ruby binding of GdkPixbuf-2.x.","ruby-gettext":"Gettext gem is a pure Ruby Localization(L10n) library and tool which is modeled after the GNU gettext package.","ruby-gettext-setup":"A gem that configures gettext for internationalization","ruby-gio2":"Ruby\/GIO2 is a Ruby binding of gio-2.x.","ruby-glib2":"Ruby\/GLib2 is a Ruby binding of GLib-2.x.","ruby-gobject-introspection":"Ruby\/GObjectIntrospection is a Ruby binding of GObjectIntrospection.","ruby-gpgme":"Ruby interface to GnuPG Made Easy (GPGME)","ruby-gtk3":"Ruby\/GTK3 is a Ruby binding of GTK+-3.x.","ruby-hashdiff":"Library to compute the smallest difference between two hashes","ruby-hitimes":"Fast, high resolution timer library for recording performance metrics","ruby-hocon":"A collection of text algorithms: Levenshtein, Soundex, Metaphone, Double Metaphone, Porter Stemming","ruby-hoe":"Hoe is a rake\/rubygems helper for project Rakefiles","ruby-hpricot":"A swift, liberal HTML parser with a fantastic library","ruby-http-cookie":"Ruby library to handle HTTP Cookies based on RFC 6265","ruby-httpclient":"gives something like the functionality of libwww-perl (LWP) in Ruby","ruby-i18n":"New wave internationalisation support for Ruby","ruby-iconv":"Wrapper library for iconv","ruby-immutable-struct":"Create struct-like classes that don't have setters, but have an awesome constructor","ruby-irb":"Interactive Ruby command-line tool for REPL (Read Eval Print Loop).","ruby-jekyll-sass-converter":"Sass converter for Jekyll","ruby-json":"JSON implementation for Ruby","ruby-json-schema":"Interface for validating JSON objects against a JSON schema conforming to JSON Schema Draft 4.","ruby-kramdown":"Fast, pure Ruby Markdown superset converter, using a strict syntax definition","ruby-locale":"A pure ruby library which provides basic and general purpose APIs for localization.","ruby-log4r":"Log4r, logging framework for ruby","ruby-mail":"A really Ruby Mail handler","ruby-mail-gpg":"GPG\/MIME extension for the Ruby Mail Library","ruby-manpages":"Man pages support for ruby gems","ruby-marisa":"Ruby language binding for marisa","ruby-maruku":"Pure-Ruby Markdown-superset interpreter","ruby-mercenary":"Easier way to build your command-line scripts","ruby-metadata-json-lint":"Tool to check the validity of Puppet metadata.json files","ruby-metadata_json_deps":"Verify all your dependencies allow the latest versions on Puppet Forge","ruby-mime-types":"MIME Content-Type database","ruby-mime-types-data":"provides a registry for information about MIME media type definitions","ruby-mini_mime":"A lightweight mime type lookup toy","ruby-mini_portile":"Simple autoconf builder for developers","ruby-mini_portile2":"Simple autoconf builder for developers","ruby-minitar":"A pure-Ruby library that provides the ability to deal with POSIX tar(1) archive files","ruby-minitest":"Complete suite of testing facilities supporting TDD, BDD, mocking, and benchmarking","ruby-minitest-global_expectations":"Support minitest expectation methods for all objects","ruby-minitest-proveit":"forces all tests to prove success (via at least one assertion) rather than rely on the absence of failure.","ruby-minitest-retry":"re-run the test when the test fails","ruby-minitest-sprint":"Runs (Get it? It's fast!) your tests and makes it easier to rerun individual failures","ruby-minitest-stub-const":"Stub constants for the duration of a block in MiniTest.Similar to RSpecs stub_const","ruby-mocha":"Mocha is a mocking and stubbing library for Ruby","ruby-molinillo":"Provides support for dependency resolution","ruby-msgpack":"MessagePack implementation for Ruby","ruby-multi_json":"A common interface to multiple JSON libraries.","ruby-multipart-parser":"A simple parser for multipart MIME messages, written in Ruby","ruby-multipart-post":"A multipart form post accessory for Net::HTTP.","ruby-mustache":"Mustache is a framework-agnostic way to render logic-free views.","ruby-mustermann":"Your personal string matching expert","ruby-native-package-installer":"A helper to install native packages on \"gem install\"","ruby-nats-pure":"Ruby client for the NATS messaging system","ruby-ncurses":"Module for interactive text console applications (ncurses)","ruby-net-dns":"Pure Ruby DNS library, with a clean OO interface and an extensible API","ruby-net-ping":"Provides a ping interface for Ruby. It includes separate TCP, HTTP, LDAP, ICMP, UDP and external ping classes.","ruby-network_interface":"Library to get network interface information","ruby-nio4r":"Abstract, cross-platform stateful I\/O selector API for Ruby","ruby-nokogiri":"Nokogiri (鋸) is an HTML, XML, SAX, and Reader parser","ruby-optimist":"Commandline option parser for Ruby that just gets out of your way","ruby-packetfu":"Library for reading and writing packets to an interface or to a libpcap-formatted file","ruby-paint":"Ruby paint manages terminal colors and effects","ruby-pango":"Ruby\/Pango is a Ruby binding of pango-1.x.","ruby-path_expander":"Helps pre-process command-line arguments expanding directories into their constituent file","ruby-pathutil":"Faster pure Ruby implementation of Pathname with extra bits","ruby-pcaprub":"Consistent interface to libpcap packet capture library","ruby-pg":"Ruby interface to the PostgreSQL RDBMS","ruby-pkg-config":"Implementation of pkg-config in ruby","ruby-polyglot":"Allows custom language loaders to be hooked into require","ruby-power_assert":"Power Assert for Ruby","ruby-public_suffix":"Domain name parser based on the Public Suffix List","ruby-puppet-resource_api":"This library provides a simple way to write new native resources for puppet.","ruby-puppet_forge":"Ruby client for the Puppet Forge API. Access and manipulate the Puppet Forge API from Ruby.","ruby-puppet_metadata":"Data structures for the Puppet Metadata","ruby-rack":"Minimal, modular, and adaptable interface for developing web applications","ruby-rack-protection":"Protect against typical web attacks, works with all Rack apps, including Rails","ruby-rack-test":"small, simple testing API for Rack apps","ruby-rainbow":"Rainbow is extension to ruby's String class adding support for colorizing text on ANSI terminal","ruby-rake":"Make-like build tool implemented in Ruby","ruby-rake-compiler":"Rake-based Ruby Extension (C, Java) task generator","ruby-rb-fsevent":"FSEvents API with signals handled (without RubyCocoa)","ruby-rb-inotify":"Thorough inotify wrapper for Ruby using FFI","ruby-rdiscount":"Fast Implementation of Gruber's Markdown in C","ruby-rdoc":"Command-line documentation generator for Ruby projects","ruby-red-colors":"Provides a wide array of features for dealing with colors","ruby-reline":"Alternative GNU Readline or Editline implementation by pure Ruby.","ruby-rexml":"An XML toolkit for Ruby","ruby-ronn-ng":"Manual page formatter that generates man pages from markdown","ruby-rouge":"Pure-ruby code highlighter that is compatible with pygments","ruby-rr":"RR is a test double framework that features a rich selection of double techniques and a terse syntax","ruby-rspec":"RSpec meta-gem that depends on the other components","ruby-rspec-core":"RSpec runner and formatters","ruby-rspec-expectations":"Provides a readable API to express expected outcomes of a code example","ruby-rspec-its":"RSpec extension gem for attribute matching","ruby-rspec-mocks":"RSpecs 'test double' framework, with support for stubbing and mocking","ruby-rspec-support":"Common code needed by the other RSpec gems. Not intended for direct use","ruby-ruby2_keywords":"Shim library for Module#ruby2_keywords","ruby-rubydns":"High-performance asynchronous DNS server and resolver","ruby-rugged":"A Ruby binding to the libgit2 linkable library","ruby-safe_yaml":"Parse YAML safely","ruby-samus":"Helps you automate the release of Open Source Software","ruby-sass":"Sass makes CSS fun again","ruby-sass-listen":"Listens to file modifications and notifies you about the changes","ruby-sassc":"Use libsass with Ruby!","ruby-sd_notify":"Pure Ruby implementation of systemd's sd_notify(3)","ruby-semantic_puppet":"Tools used by Puppet to parse, validate, and compare Semantic Versions and Version Ranges and to query and resolve module dependencies.","ruby-shadow":"Shadow password module","ruby-sinatra":"Classy web-development dressed in a DSL","ruby-spdx-licenses":"Tool to check the validity of Puppet metadata.json files","ruby-sqlite3":"Ruby bindings for the SQLite3 embedded database","ruby-stomp":"Ruby client for the Stomp messaging protocol","ruby-sync":"A Ruby module packaged as a gem that provides a two-phase lock with a counter. Was in Ruby core until 2.7","ruby-sys-proctable":"An interface for providing process table information","ruby-term-ansicolor":"A ruby library that colors strings using ANSI escape sequences","ruby-test-unit":"An xUnit family unit testing framework for Ruby","ruby-test-unit-rr":"test-unit-rr is a RR adapter for test-unit","ruby-test_declarative":"Simply adds a declarative test method syntax to test\/unit","ruby-text":"A collection of text algorithms: Levenshtein, Soundex, Metaphone, Double Metaphone, Porter Stemming","ruby-thin":"Thin and fast Ruby web server","ruby-thor":"Toolkit for building powerful command-line interfaces","ruby-tilt":"Generic interface to multiple Ruby template engines","ruby-timers":"Schedule procs to run after a certain time, or at periodic intervals, using any API that accepts a timeout","ruby-tins":"All the stuff that is not good\/big enough for a real library","ruby-titlecase":"Ruby version of John Gruber's TitleCase.pl","ruby-treetop":"A Ruby-based text parsing and interpretation DSL","ruby-trollop":"Commandline option parser for Ruby that just gets out of your way","ruby-tzinfo":"Daylight savings aware transformations between times in different time zones","ruby-unf":"Wrapper library to bring Unicode Normalization Form support to Ruby\/JRuby.","ruby-unicorn-engine":"Lightweight, multi-platform, multi-architecture CPU emulator framework based on QEMU","ruby-vimrunner":"Spawn a Vim instance and control it programatically","ruby-webmock":"Allows stubbing HTTP requests and setting expectations on HTTP requests.","ruby-webrick":"An HTTP server toolkit that can be configured as an HTTPS server","ruby-x25519":"An efficient public key cryptography library for Ruby providing key exchange\/agreement via the X25519 (a.k.a. Curve25519) Elliptic Curve Diffie-Hellman function as described in RFC 7748","ruby-yard":"YARD is a Ruby Documentation tool. The Y stands for \"Yay!\"","ruby-zeitwerk":"Efficient and thread-safe code loader for Ruby","ruby2.6":"An object-oriented language for quick and easy programming (version 2.6)","ruby2.7":"An object-oriented language for quick and easy programming, version 2.7","ruby27-augeas":"Provides Ruby bindings for augeas","ruby27-concurrent":"Modern concurrency tools including agents, futures, promises, thread pools, actors, supervisors, and more.","ruby27-deep_merge":"Recursively merge Ruby hashes","ruby27-diff-lcs":"Diff::LCS computes the difference between two Enumerable sequences using the McIlroy-Hunt longest common subsequence (LCS) algorithm","ruby27-hocon":"A collection of text algorithms: Levenshtein, Soundex, Metaphone, Double Metaphone, Porter Stemming","ruby27-hoe":"Hoe is a rake\/rubygems helper for project Rakefiles","ruby27-httpclient":"gives something like the functionality of libwww-perl (LWP) in Ruby","ruby27-minitest":"Complete suite of testing facilities supporting TDD, BDD, mocking, and benchmarking","ruby27-mocha":"Mocha is a mocking and stubbing library for Ruby","ruby27-multi_json":"A common interface to multiple JSON libraries.","ruby27-power_assert":"Power Assert for Ruby","ruby27-puppet-resource_api":"This library provides a simple way to write new native resources for puppet.","ruby27-rake":"Make-like build tool implemented in Ruby","ruby27-rdoc":"Command-line documentation generator for Ruby projects","ruby27-rspec":"RSpec meta-gem that depends on the other components","ruby27-rspec-core":"RSpec runner and formatters","ruby27-rspec-expectations":"Provides a readable API to express expected outcomes of a code example","ruby27-rspec-mocks":"RSpecs 'test double' framework, with support for stubbing and mocking","ruby27-rspec-support":"Common code needed by the other RSpec gems. Not intended for direct use","ruby27-semantic_puppet":"Tools used by Puppet to parse, validate, and compare Semantic Versions and Version Ranges and to query and resolve module dependencies.","ruby27-shadow":"Shadow password module","ruby27-sync":"A Ruby module packaged as a gem that provides a two-phase lock with a counter. Was in Ruby core until 2.7","ruby27-test-unit":"An xUnit family unit testing framework for Ruby","runc":"CLI tool for managing OCI compliant containers","rust-analyzer":"Rust compiler front-end for IDEs","rust-bindgen":"Automatically generates Rust FFI bindings to C (and some C++) libraries","rust-libslirp":"High-level bindings & helper process for libslirp.","rust-racer":"Code completion for Rust","rustup":"The Rust toolchain installer","rx_tools":"Implementation of librtlsdr rtl_* tools using SoapySDR as the driver backend","rxvt-unicode":"Unicode enabled rxvt-clone terminal emulator (urxvt)","rxvt-unicode-terminfo":"Terminfo files for urxvt","rz-cutter":"Qt and C++ GUI for rizin reverse engineering framework","rz-ghidra":"Deep ghidra decompiler integration for rizin and rz-cutter"}