{"openldap":"Servidor e cliente do Protocolo de Acesso de DiretórioLightWeight(LDAP)","openresolv":"resolv.conf management framework (resolvconf)","openssh":"Premier connectivity tool for remote login with the SSH protocol","openssl-1.0":"The Open Source toolkit for Secure Sockets Layer and Transport Layer Security","openssl":"The Open Source toolkit for Secure Sockets Layer and Transport Layer Security","ocaml":"A functional language with OO extensions","ocaml-compiler-libs":"Several modules used internally by the OCaml compiler","ocaml-ctypes":"Library for binding to C libraries using pure OCaml","ocaml-integers":"Library for binding to C libraries using pure OCaml","ocaml-result":"Compatibility Result module","ocaml-topkg":"A packager for distributing OCaml software","ocamlbuild":"Build tool, that has built-in rules for building OCaml library and programs","ocl-icd":"OpenCL ICD Bindings","okteta":"KDE hex editor for viewing and editing the raw data of files","okular":"Document Viewer","openal":"Cross-platform 3D audio library, software implementation","openal-examples":"Cross-platform 3D audio library, software implementation (example programs)","openbabel":"A library designed to interconvert between many file formats used in molecular modeling and computational chemistry","opencl-clhpp":"OpenCL C++ header files","opencl-headers":"OpenCL (Open Computing Language) header files","opencl-mesa":"OpenCL support for AMD\/ATI Radeon mesa drivers","opencl-nvidia":"OpenCL implemention for NVIDIA","openconnect":"Open client for Cisco AnyConnect VPN","opencore-amr":"Open source implementation of the Adaptive Multi Rate (AMR) speech codec","opencv":"Open Source Computer Vision Library","opencv-samples":"Open Source Computer Vision Library (samples)","openexr":"An high dynamic-range image file format library","opengl-man-pages":"OpenGL Man Pages - OpenGL 4.x","openjade":"Implementation of the DSSSL language","openjdk-doc":"OpenJDK Java 14 documentation","openjdk-src":"OpenJDK Java 14 sources","openjdk11-doc":"OpenJDK Java 11 documentation","openjdk11-src":"OpenJDK Java 11 sources","openjdk7-doc":"OpenJDK Java 7 documentation","openjdk7-src":"OpenJDK Java 7 sources","openjdk8-doc":"OpenJDK Java 8 documentation","openjdk8-src":"OpenJDK Java 8 sources","openjpeg2":"An open source JPEG 2000 codec, version 2.3.1","openmp":"LLVM OpenMP Runtime Library","openmpi":"High performance message passing library (MPI)","opensp":"A library and a set of tools for validating, parsing and manipulating SGML and XML documents","openvpn":"An easy-to-use, robust and highly configurable VPN (Virtual Private Network)","opus":"Totally open, royalty-free, highly versatile audio codec","orage":"A simple calendar application with reminders for Xfce","orc":"Optimized Inner Loop Runtime Compiler","orca":"Screen reader for individuals who are blind or visually impaired","ossp":"Emulate OSS device using CUSE","ostree":"Operating system and container binary deployment and upgrades","oxygen":"KDE Oxygen style","oxygen-gtk2":"Port of the default KDE widget theme (Oxygen) to GTK2","oxygen-icons":"The Oxygen Icon Theme","oxygen-icons-svg":"The Oxygen Icon Theme (Scalable Vector Graphics)","oath-toolkit":"OATH one-time password toolkit","obconf":"A GTK+ based configuration tool for the Openbox windowmanager","obconf-qt":"Openbox configuration tool. Qt port of ObConf","obs-studio":"Free, open source software for live streaming and recording","ocaml-cairo":"OCaml binding to Cairo, a 2D Vector Graphics Library","ocaml-csexp":"OCaml canonical S-expressions","ocaml-findlib":"OCaml package manager","ocaml-lablgl":"OCaml interface to OpenGL","ocaml-num":"Library for arbitrary-precision integer and rational arithmetic that used to be part of the OCaml core distribution","ocrad":"OCR (Optical Character Recognition) program based on a feature extraction method","ocrfeeder":"GTK+ document layout analysis and optical character recognition application","octave":"A high-level language, primarily intended for numerical computations.","ode":"High performance library for simulating rigid body dynamics","odt2txt":"extracts the text out of OpenDocument Texts","offlineimap":"Synchronizes emails between two repositories","offroad":"Offline vector map display ported from OsmAnd","ogmtools":"Information, extraction or creation for OGG media streams","ogre":"Scene-oriented, flexible 3D engine written in C++","oidentd":"An RFC1413 compliant ident daemon","ois":"Object Oriented Input System","onboard":"On-screen keyboard useful on tablet PCs or for mobility impaired users","onednn":"oneAPI Deep Neural Network Library (oneDNN)","oniguruma":"a regular expressions library","onionshare":"Share a file over Tor Hidden Services anonymously and securely","opam":"OCaml package manager","open-iscsi":"iSCSI userland tools","open-isns":"iSNS server and client for Linux","open-vm-tools":"The Open Virtual Machine Tools (open-vm-tools) are the open source implementation of VMware Tools","openapi-generator":"Generation of API client libraries, server stubs, documentation and configuration","openblas":"An optimized BLAS library based on GotoBLAS2 1.13 BSD","openbox":"Highly configurable and lightweight X11 window manager","openbsd-netcat":"TCP\/IP swiss army knife. OpenBSD variant.","openbve":"Free-as-in-freedom train simulator placed in the public domain","opencascade":"Open CASCADE Technology, 3D modeling & numerical simulation","opencascade74":"Open CASCADE Technology, 3D modeling & numerical simulation","opencc":"Library for Open Chinese Convert","opencc-doc":"Documentation for Library for Open Chinese Convert","opencollada":"Stream based reader and writer library for COLLADA files","opencolorio":"A color management framework for visual effects and animation","opencsg":"Library for image-based CSG rendering using OpenGL.","opendbx":"Extremely lightweight but extensible database access library written in C.","opendesktop-fonts":"Chinese TrueType Fonts","opendht":"C++14 Distributed Hash Table (DHT) implementation","opendkim":"An open source implementation of the DKIM sender authentication system. Based on a fork of dkim-milter.","opendmarc":"Free open source software implementation of the DMARC specification","opendoas":"Run commands as super user or another user","openethereum":"Fast and feature-rich multi-network Ethereum client","openfire":"High performance XMPP (Jabber) server.","openfortivpn":"An open implementation of Fortinet's proprietary PPP+SSL VPN solution","openfpgaloader":"Universal utility for programming FPGA","openimagedenoise":"Intel(R) Open Image Denoise library","openimageio":"A library for reading and writing images, including classes, utilities, and applications","openipmi":"Full-function IPMI (Intelligent Platform Management Interface) system","openlibm":"Standalone implementation of C mathematical functions","openmotif":"Open Motif","openmw":"Open-source engine reimplementation for the role-playing game Morrowind","openntpd":"Free, easy to use implementation of the Network Time Protocol","openocd":"Debugging, in-system programming and boundary-scan testing for embedded target devices","openra":"An open-source implementation of the Red Alert engine using .NET\/Mono and OpenGL","openrct2":"Open source re-implementation of Roller Coaster Tycoon 2 (requires full copy of the game)","opensc":"Tools and libraries for smart cards","openscad":"The programmers solid 3D CAD modeller","openscenegraph":"Open Source, high performance real-time graphics toolkit","openshadinglanguage":"Advanced shading language for production GI renderers","openshot":"An award-winning free and open-source video editor","opensips":"An Open Source SIP Server able to act as a SIP proxy, registrar, location server, redirect server ...","opensmtpd":"Free implementation of the server-side SMTP protocol","opensmtpd-filter-rspamd":"OpenSMTPD filter integration for Rspamd","opensmtpd-filter-senderscore":"OpenSMTPD filter integration for Sender Score","openssh-askpass":"A plasma-like passphrase dialog for ssh","opensubdiv":"An Open-Source subdivision surface library","opentoonz":"Software for producing a 2D animation","openttd":"An engine for running Transport Tycoon Deluxe.","openttd-opengfx":"A free graphics set for openttd","openttd-opensfx":"Free sound set for openttd","openvdb":"A large suite of tools for the efficient storage and manipulation of sparse volumetric data discretized on three-dimensional grids","openvr":"API and runtime that allows access to VR hardware from multiple vendors","openvswitch":"Production Quality, Multilayer Open Virtual Switch","openzwave":"A C++ library to control Z-Wave Networks via a USB Z-Wave Controller","opera":"A fast and secure web browser","opera-ffmpeg-codecs":"additional support for proprietary codecs for opera","operator-sdk":"SDK for building Kubernetes applications","ophcrack":"Windows password cracker based on rainbow tables","opnplug":"FM synthesizer for OPNMIDI with OPN2 chip emulation","optipng":"Compresses PNG files to a smaller size, without losing any information.","opus-tools":"Collection of tools for Opus audio codec","opusfile":"Library for opening, seeking, and decoding .opus files","or1k-elf-binutils":"A set of programs to assemble and manipulate binary and object files for the OpenRISC 1000 (bare-metal) target","or1k-elf-gcc":"The GNU Compiler Collection - cross compiler for OpenRISC 1000 (bare-metal) target","or1k-elf-gdb":"The GNU Debugger for the OpenRISC 100 (bare-metal) target","or1k-elf-newlib":"A C standard library implementation intended for use on embedded systems (OpenRISC 1000 bare metal)","ortp":"A Real-time Transport Protocol (RTP) library","os-prober":"Utility to detect other OSes on a set of drives","osc2midi":"A highly flexible and configurable OSC to JACK MIDI (and back) bridge","oscpack":"Open Sound Control packet manipulation library","osdbattery":"Displays battery information in the OSD style","osdlyrics":"A lyric show compatible with various media players","osinfo-db":"Osinfo database of information about operating systems for virtualization provisioning tools","osinfo-db-tools":"Tools for managing the osinfo database","osm-gps-map":"GTK+ 3 library for showing OSM tiles","osmid":"A lightweight, portable, easy to use tool to convert MIDI to OSC and OSC to MIDI","osmo":"A handy personal organizer","ospray":"A Ray Tracing Based Rendering Engine for High-Fidelity Visualization","osquery":"SQL powered operating system instrumentation, monitoring, and analytics","otf-cascadia-code":"A monospaced font by Microsoft that includes programming ligatures","otf-cormorant":"Open-source display font family","otf-fantasque-sans-mono":"Font family with a great monospaced variant for programmers","otf-fira-mono":"Mozilla's monospace typeface designed for Firefox OS","otf-fira-sans":"Mozilla's sans-serif typeface designed for Firefox OS","otf-font-awesome":"Iconic font designed for Bootstrap","otf-hermit":"A monospace font designed to be clear, pragmatic and very readable.","otf-ipaexfont":"Japanese outline fonts following the tradition of Japanese printing font","otf-ipafont":"Japanese outline fonts by Information-technology Promotion Agency, Japan (IPA)","otf-ipamjfont":"Japanese outline Mincho fonts implementing IVS compliant with Hanyo-Denshi collection (based on IPAex Mincho fonts)","otf-latin-modern":"Improved version of Computer Modern fonts as used in LaTeX","otf-latinmodern-math":"Improved version of Computer Modern fonts as used in LaTeX – OpenType Math component","otf-overpass":"An open source font family inspired by Highway Gothic esp. suited for signs, lettering and web sites","otter-browser":"Web browser aiming to recreate the best aspects of the classic Opera (12.x) UI using Qt5","otter-browser-nowebengine":"Web browser aiming to recreate the best aspects of the classic Opera (12.x) UI using Qt5 without WebEngine support","owl-lisp":"Simple purely functional lisp","owncloud-client":"ownCloud client based on mirall","oxipng":"A lossless PNG compression optimiser"}