{"readline":"GNU readline ライブラリ","reiserfsprogs":"Reiserfs ユーティリティ","rpcbind":"portmap replacement which supports RPC over various protocols","run-parts":"ディレクトリ内のスクリプトやプログラムを実行","r":"Language and environment for statistical computing and graphics","radvd":"IPv6 ルーター広告デーモン","randrproto":"X11 RandR extension wire protocol","raptor":"A C library that parses RDF\/XML\/N-Triples into RDF triples","rarian":"Documentation meta-data library, designed as a replacement for Scrollkeeper.","rasqal":"A free C library that handles Resource Description Framework (RDF) query syntaxes, query construction and query execution returning result bindings","razor":"A distributed, collaborative, spam detection and filtering network","rcs":"Revision Control System: manages multiple revisions of files","re2":"Fast, safe, thread-friendly regular expression engine","re2c":"A tool for generating C-based recognizers from regular expressions","recode":"Converts files between various character sets and usages","recordproto":"X11 Record extension wire protocol","redland":"Library that provides a high-level interface to RDF data","redland-storage-mysql":"MySQL storage support for Redland","redland-storage-postgresql":"PostgreSQL storage support for Redland","redland-storage-sqlite":"SQLite storage support for Redland","redland-storage-virtuoso":"Virtuoso storage support for Redland","refind-efi":"Rod Smith's fork of rEFIt UEFI Boot Manager - Built with GNU-EFI libs","renderproto":"X11 Render extension wire protocol","resourceproto":"X11 Resource extension wire protocol","rest":"Helper library for RESTful services","rhino":"Open-source implementation of JavaScript written entirely in Java","rhino-javadoc":"Open-source implementation of JavaScript written entirely in Java - Javadoc","rhythmbox":"Music playback and management application","rocs":"Graph Theory IDE","rosegarden":"MIDI\/audio sequencer and notation editor","rp-pppoe":"Roaring Penguin's Point-to-Point Protocol over Ethernet client","rpmextract":"Script to convert or extract RPM archives (contains rpm2cpio)","rrdtool":"Data logging and graphing application","rsync":"A file transfer program to keep remote files in sync","rtkit":"Realtime Policy and Watchdog Daemon","rtmpdump":"rtmp ストリームをダウンロードするツール","rubberband":"Time-stretching and pitch-shifting audio library and utility","ruby":"簡単楽しいプログラミングのオブジェクト指向言語","ruby-docs":"ruby のドキュメントファイル","rygel":"UPnP AV MediaServer and MediaRenderer that allows you to easily share audio, video and pictures, and control of media player on your home network","r128-dri":"ATI Rage128 の Mesa DRI ドライバー","r8168":"Realtek 8168 ネットワークカードのカーネルモジュール","r8168-lts":"A kernel module for Realtek 8168 network cards for linux-lts","rabbitmq":"Highly reliable and performant enterprise messaging implementation of AMQP written in Erlang\/OTP","rabbitmqadmin":"Command-line tool for managing RabbitMQ server (requires \"management\" plugin)","racket":"A full-spectrum language with DrRacket IDE. Formerly known as PLT Scheme.","racket-docs":"Docs for the full-spectrum language formerly known as PLT Scheme.","racket-minimal":"Minimal Racket installation, without DrRacket.","radamsa":"General purpose mutation based fuzzer","radare2":"Open-source tools to disasm, debug, analyze and manipulate binary files","radcli":"Client library for writing Radius clients in C or C++","radeontool":"Lowlevel tools to tweak register and dump state on radeon GPUs","ragel":"Compiles finite state machines from regular languages into executable C, C++, Objective-C, or D code.","range-v3":"Experimental range library for C++11\/14\/17","ranger":"シンプルな vim ライクなファイルマネージャ","rankwidth":"A program that calculates rank-width and rank-decompositions","rapid-photo-downloader":"写真・動画ダウンローダ","rapidjson":"A fast JSON parser\/generator for C++ with both SAX\/DOM style API","ratpoints":"A program that uses an optimized quadratic sieve algorithm in order to find rational points on hyperelliptic curves","ratpoison":"A simple keystroke-driven window manager","raul":"C++ Realtime Audio Utility Library","raw-thumbnailer":"A lightweight and fast raw image thumbnailer that can be used by file managers.","rawdog":"RSS Aggregator Without Delusions Of Grandeur","rawtherapee":"A powerful cross-platform raw image processing program","rbutil":"Rockbox Utility","rclone":"Sync files to and from Google Drive, S3, Swift, Cloudfiles, Dropbox and Google Cloud Storage","rdesktop":"An open source client for Windows Remote Desktop Services","rdiff-backup":"A utility for local\/remote mirroring and incremental backups.","read-edid":"Program that can get information from a PNP monitor","reaver":"Brute force attack against Wifi Protected Setup","rebar":"A sophisticated build-tool for Erlang projects that follows OTP principles.","recoll":"Full text search tool based on Xapian backend","recorditnow":"A plugin based desktop recorder for KDE SC 4","recordmydesktop":"Produces a OGG encapsulated Theora\/Vorbis recording of your desktop","redis":"Advanced key-value store","redshift":"Adjusts the color temperature of your screen according to your surroundings.","referenceassemblies-pcl":"Microsoft .NET Portable Library Reference Assemblies","reflector":"A Python 3 module and script to retrieve and filter the latest Pacman mirror list.","regexxer":"Interactive search and replace tool for GNOME","remake":"Enhanced GNU Make - tracing, error reporting, debugging, profiling and more","remind":"A sophisticated calendar and alarm program.","remmina":"GTK+ で書かれたリモートデスクトップクライアント","renameutils":"A set of programs designed to make renaming of files faster and less cumbersome","renpy":"Ren'Py ビジュアルノベルエンジン","renpy-demos":"Ren'Py ビジュアルノベルエンジン","repo":"The Multiple Git Repository Tool from the Android Open Source Project","repose":"Arch Linux リポジトリ作成ツール","reptyr":"Utility for taking an existing running program and attaching it to a new terminal","restbed":"A framework for asynchronous RESTful functionality in C++11 applications","retext":"Markdown と ReStructuredText マークアップ言語のシンプルなエディタ","rethinkdb":"分散型の強力かつスケーラブルな NoSQL データベース","rethinkdb-utils":"RethinkDB データベースユーティリティ","retro-gtk":"Toolkit to write GTK+ 3 based Libretro frontends","retroarch":"libretro API のリファレンスフロントエンド","retroarch-assets-xmb":"XMB menu assets for RetroArch","retroarch-autoconfig-udev":"udev joypad autoconfig for RetroArch","rev-plugins":"LADSPA stereo and ambisonic reverb plugin based on zita-rev1","rfc":"RFCs from rfc-editor.org","rhash":"ファイルのハッシュサムを検証するユーティリティ","ring-daemon":"Ring is a free and universal communication platform which preserves the users' privacy and freedoms (daemon)","ring-gnome":"Ring is a free and universal communication platform which preserves the users' privacy and freedoms (GNOME client)","riot-desktop":"A glossy Matrix collaboration client for the desktop.","riot-web":"A glossy Matrix collaboration client for the web.","ripgrep":"A search tool that combines the usability of ag with the raw speed of grep","ristretto":"Fast and lightweight picture-viewer for Xfce4","rkhunter":"Checks machines for the presence of rootkits and other unwanted tools.","rkt":"アプリコンテナランタイム","rlog":"A flexible message logging facility for C++ programs and libraries","rlwrap":"Adds readline-style editing and history to programs.","rmlint":"Tool to remove duplicates and other lint, being much faster than fdupes","rmlint-shredder":"rmlint のグラフィカルユーザーインターフェイス","rng-tools":"乱数生成関連ユーティリティ","robotfindskitten":"Yet another Zen simulation","rocksndiamonds":"game similiar to Boulderdash with lots of levels","rocksndiamonds-data":"rockndiamonds のゲームデータとレベル","rofi":"A window switcher, application launcher and dmenu replacement","rogue":"The original dungeon crawl game.","ropper":"Show information about binary files and find gadgets to build rop chains for different architectures","roundcubemail":"PHP によるウェブベースのメールクライアント","routino":"Router for OpenStreetMap Data","rox":"A small and fast file manager which can optionally manage the desktop background and panels","rox-lib":"Shared code which can be used by other ROX applications. This is rox-lib2","rsibreak":"Takes care of your health and regularly breaks your work to avoid repetitive strain injury (RSI)","rsnapshot":"リモートファイルシステムのスナップショットユーティリティ","rtl-sdr":"Driver for Realtek RTL2832U, allowing general purpose software defined radio (SDR).","rtorrent":"Ncurses BitTorrent client based on libTorrent","rubber":"A wrapper for LaTeX and friends","rubiks":"Several programs for working with Rubik's cubes","rubinius":"Ruby runtime written in Ruby, designed for concurrency","rubinius-ruby":"Ruby compat for Rubinius","ruby-addressable":"URI Implementation","ruby-async":"Composable asynchronous I\/O","ruby-async-dns":"Asynchronous DNS resolver and server","ruby-async-io":"Provides support for asynchonous TCP, UDP, UNIX and SSL sockets","ruby-atk":"Ruby\/ATK is a Ruby binding of ATK-1.0.x.","ruby-augeas":"Provides Ruby bindings for augeas","ruby-bundler":"Manages an application's dependencies through its entire life, across many machines, systematically and repeatably.","ruby-cairo":"Ruby bindings for cairo","ruby-cairo-gobject":"Ruby\/CairoGObject is a Ruby binding of cairo-gobject","ruby-celluloid":"Celluloid provides a simple and natural way to build fault-tolerant concurrent programs in Ruby","ruby-celluloid-dns":"Simple finite state machines with integrated Celluloid timeout support","ruby-celluloid-essentials":"Internally used tools, and superstructural dependencies of Celluloid","ruby-celluloid-extras":"Classes to support examples, benchmarks, or add special functionality","ruby-celluloid-fsm":"Simple finite state machines with integrated Celluloid timeout support","ruby-celluloid-io":"Evented IO for Celluloid actors","ruby-celluloid-pool":"Implementation of an actor pool, based on the Celluloid concurrent object framework","ruby-celluloid-supervision":"Simple finite state machines with integrated Celluloid timeout support","ruby-colorator":"ターミナルのテキストをカラー化","ruby-colorize":"Ruby string class extension to set color, background and text effect using ANSI escape sequences","ruby-daemons":"Easy way to wrap existing ruby scripts to be run as a daemon","ruby-dbus":"Ruby module for interaction with D-Bus","ruby-diff-lcs":"Diff::LCS computes the difference between two Enumerable sequences using the McIlroy-Hunt longest common subsequence (LCS) algorithm","ruby-em-proxy":"EventMachine Proxy DSL for writing high-performance transparent \/ intercepting proxies","ruby-eventmachine":"EventMachine: fast, simple event-processing library","ruby-faraday":"HTTP/REST API クライアントライブラリ","ruby-faraday-middleware":"Various middleware for Faraday","ruby-ffi":"Ruby FFI","ruby-forwardable-extended":"Extends forwardable with delegation to hashes and instance variables","ruby-gdk_pixbuf2":"Ruby\/GdkPixbuf2 is a Ruby binding of GdkPixbuf-2.x.","ruby-gio2":"Ruby\/GIO2 is a Ruby binding of gio-2.x.","ruby-glib2":"Ruby\/GLib2 is a Ruby binding of GLib-2.x.","ruby-gobject-introspection":"Ruby\/GObjectIntrospection is a Ruby binding of GObjectIntrospection.","ruby-gpgme":"Ruby interface to GnuPG Made Easy (GPGME)","ruby-gtk2":"Ruby\/GTK2 is a Ruby binding of GTK+-2.x.","ruby-hitimes":"Fast, high resolution timer library for recording performance metrics","ruby-hpricot":"A swift, liberal HTML parser with a fantastic library","ruby-iconv":"iconv のラッパーライブラリ","ruby-jekyll-sass-converter":"Sass converter for Jekyll","ruby-kramdown":"Fast, pure Ruby Markdown superset converter, using a strict syntax definition","ruby-mail":"A really Ruby Mail handler","ruby-mail-gpg":"GPG\/MIME extension for the Ruby Mail Library","ruby-marisa":"Ruby language binding for marisa","ruby-maruku":"Pure-Ruby Markdown-superset interpreter","ruby-mercenary":"Easier way to build your command-line scripts","ruby-mime-types":"MIME Content-Type database","ruby-mime-types-data":"provides a registry for information about MIME media type definitions","ruby-mini_mime":"A lightweight mime type lookup toy","ruby-mini_portile2":"Simple autoconf builder for developers","ruby-msgpack":"Ruby の MessagePack 実装","ruby-multi_json":"A common interface to multiple JSON libraries.","ruby-multipart-post":"A multipart form post accessory for Net::HTTP.","ruby-mustache":"Mustache is a framework-agnostic way to render logic-free views.","ruby-native-package-installer":"native-package-installer helps to install native packages on \"gem install\"","ruby-nats-pure":"Ruby client for the NATS messaging system","ruby-ncurses":"Module for interactive text console applications (ncurses)","ruby-net-dns":"Pure Ruby DNS library, with a clean OO interface and an extensible API","ruby-network_interface":"Library to get network interface information","ruby-nio4r":"Abstract, cross-platform stateful I\/O selector API for Ruby","ruby-packetfu":"Library for reading and writing packets to an interface or to a libpcap-formatted file","ruby-paint":"Ruby paint manages terminal colors and effects","ruby-pango":"Ruby\/Pango is a Ruby binding of pango-1.x.","ruby-pathutil":"Faster pure Ruby implementation of Pathname with extra bits","ruby-pcaprub":"Consistent interface to libpcap packet capture library","ruby-pg":"Pg is the Ruby interface to the Postgresql RDBMS","ruby-pkg-config":"Implementation of pkg-config in ruby","ruby-polyglot":"Allows custom language loaders to be hooked into require","ruby-public_suffix":"Domain name parser based on the Public Suffix List","ruby-rack":"Minimal, modular, and adaptable interface for developing web applications","ruby-rack-protection":"Protect against typical web attacks, works with all Rack apps, including Rails","ruby-rainbow":"Rainbow is extension to ruby's String class adding support for colorizing text on ANSI terminal","ruby-rb-inotify":"Thorough inotify wrapper for Ruby using FFI","ruby-rdiscount":"Fast Implementation of Gruber's Markdown in C","ruby-ronn":"Manual page formatter that generates man pages from markdown","ruby-rouge":"Pure-ruby code highlighter that is compatible with pygments","ruby-rspec":"RSpec meta-gem that depends on the other components","ruby-rspec-core":"RSpec runner and formatters","ruby-rspec-expectations":"Provides a readable API to express expected outcomes of a code example","ruby-rspec-mocks":"RSpecs 'test double' framework, with support for stubbing and mocking","ruby-rspec-support":"Common code needed by the other RSpec gems. Not intended for direct use","ruby-rubydns":"High-performance asynchronous DNS server and resolver","ruby-safe_yaml":"Parse YAML safely","ruby-sass":"Sass makes CSS fun again","ruby-sass-listen":"Listens to file modifications and notifies you about the changes","ruby-shadow":"Shadow password module","ruby-stomp":"Ruby client for the Stomp messaging protocol","ruby-term-ansicolor":"A ruby library that colors strings using ANSI escape sequences","ruby-thin":"Thin and fast Ruby web server","ruby-thor":"Toolkit for building powerful command-line interfaces","ruby-tilt":"Generic interface to multiple Ruby template engines","ruby-timers":"Schedule procs to run after a certain time, or at periodic intervals, using any API that accepts a timeout","ruby-tins":"All the stuff that is not good\/big enough for a real library","ruby-titlecase":"Ruby version of John Gruber's TitleCase.pl","ruby-treetop":"A Ruby-based text parsing and interpretation DSL","ruby-trollop":"Commandline option parser for Ruby that just gets out of your way","ruby-unicorn":"Lightweight, multi-platform, multi-architecture CPU emulator framework based on QEMU","ruby-yard":"YARD is a Ruby Documentation tool. The Y stands for \"Yay!\"","ruby2.3":"簡単楽しいプログラミングのオブジェクト指向言語","ruby2.3-bundler":"Manages an application's dependencies through its entire life, across many machines, systematically and repeatably.","ruby2.4":"簡単楽しいプログラミングのオブジェクト指向言語","ruby2.4-bundler":"Manages an application's dependencies through its entire life, across many machines, systematically and repeatably.","runc":"OCI 準拠コンテナを管理する CLI ツール","rust":"安全性・速度・並列性に焦点が置かれているシステムプログラミング言語","rust-docs":"安全性・速度・並列性に焦点が置かれているシステムプログラミング言語","rust-racer":"Rust のコード補完","rustfmt":"スタイルガイドにあわせて Rust のコードを整形するツール","rustup":"Rust ツールチェインインストーラ","rxvt-unicode":"A unicode enabled rxvt-clone terminal emulator (urxvt)","rxvt-unicode-terminfo":"Terminfo files for urxvt"}