{"which":"A utility to show the full path of commands","wireless_tools":"Tools allowing to manipulate the Wireless Extensions","wpa_actiond":"Daemon that connects to wpa_supplicant and handles connect and disconnect events","wpa_supplicant":"A utility providing key negotiation for WPA wireless networks","wireless-regdb":"Central Regulatory Domain Database","w3m":"ページャ兼テキストベースのウェブブラウザ","watchdog":"Watchdog デーモン","wavpack":"Audio compression format with lossless, lossy and hybrid compression modes","wayland":"A computer display server protocol","wcslib":"A C library that implements the 'World Coordinate System' (WCS) standard in FITS","webkit-sharp":"Mono\/.NET bindings for the WebKit rendering engine","webkit2gtk":"GTK+ ウェブコンテンツエンジンライブラリ","webkitgtk":"GTK+ ウェブコンテンツエンジンライブラリ","webkitgtk2":"GTK+ Web content engine library for GTK2","webrtc-audio-processing":"AudioProcessing library based on Google's implementation of WebRTC","weechat":"高速で軽く拡張可能な IRCクライアント(curses UI)","wget":"A network utility to retrieve files from the Web","whois":"The whois client by Marco d'Itri","wildmidi":"オープンソース MIDI シンセサイザー","windowmaker":"An X11 window manager with a NEXTSTEP look and feel","wipe":"Secure file wiping utility","wpa_supplicant_gui":"A Qt frontend to wpa_supplicant","wv":"MSWord library can load and parse Word 2000, 97, 95 and 6 file formats","wxgtk":"GTK+ implementation of wxWidgets API for GUI","wxgtk2.8":"GTK+ implementation of wxWidgets API for GUI","wxmaxima":"A wxWidgets GUI for the computer algebra system Maxima","wxpython":"A wxWidgets GUI toolkit for Python","wxpython2.8":"A wxWidgets GUI toolkit for Python","w3c-mathml2":"MathML XML scheme","wayland-protocols":"Specifications of extended Wayland protocols","wicd":"Wired and wireless network manager for Linux","wicd-gtk":"Wired and wireless network manager for Linux - GTK client","windowmaker-extra":"Extra WindowMaker icons and themes","wine":"A compatibility layer for running Windows programs","wine-staging":"A compatibility layer for running Windows programs - Staging branch","wine_gecko":"Wine's built-in replacement for Microsoft's Internet Explorer","w3cam":"a small and fast CGI program to retrieve images from a video4linux device.","wah-plugins":"LADSPA Wah filter plugin","warsow":"Free online multiplayer competitive FPS based on the Qfusion engine","warzone2100":"未来の地球上での3Dリアルタイム戦略ゲーム\n","wavegain":"サウンドファイルを音量を均一化するためのコマンドラインツール","wavemon":"Ncurses-based monitoring application for wireless network devices","wbar":"A quick launch bar developed with speed in mind","webfs":"Simple and instant http server for mostly static content.","webkitgtk-sharp":"C# bindings for WebKitGTK+","wesnoth":"A turn-based strategy game on a fantasy world","weston":"Reference implementation of a Wayland compositor","whitedb":"Lightweight NoSQL database library operaring fully in main memory","whowatch":"Displays information about the users currently logged on to the machine in real time","widelands":"A realtime strategy game with emphasis on economy and transport","windowlab":"A small and simple window manager.","winff":"ffmpeg の グラフィカルユーザーインターフェイス","wings3d":"3Dモデリングプログラム","wireshark-cli":"a free network protocol analyzer for Unix\/Linux and Windows - CLI version","wireshark-common":"Common files used by wireshark-gtk and wireshark-qt","wireshark-gtk":"a free network protocol analyzer for Unix\/Linux and Windows - GTK frontend","wireshark-qt":"a free network protocol analyzer for Unix\/Linux and Windows - Qt frontend","wit":"Wiimms ISO Tools","wiznote":"Opensource cross-platform cloud based note-taking client","wkhtmltopdf":"Command line tools to render HTML into PDF and various image formats","wlc":"Wayland Compositor Library","wmctrl":"Control your EWMH compliant window manager from command line","wmii":"A small, dynamic window manager for X11","wmname":"A utility to set the name of your window manager","wol":"Wake On LAN functionality in a small program. It wakes up hardware that is Magic Packet compliant","workrave":"a tool to help RSI","wput":"A command line tool to upload files to FTP site, the opposite to wget","wt":"a C++ library and application server for developing and deploying web applications","wvdial":"A dialer program to connect to the Internet","wvstreams":"A network programming library written in C++","wxcam":"Webcam application for linux","wxsqlite3":"wxWidgets wrapper for SQLite3","wyrd":"A text-based front-end to Remind.","wammu":"A wxPython-based GUI for Gammu","wanderlust":"Mail\/News reader supporting IMAP4rev1 for emacs.","warsow-data":"a free online multiplayer competitive FPS based on the Qfusion engine (data files)","web-news":"A PHP web-based NNTP client","websocketpp":"C++\/Boost Asio based websocket client\/server library","websvn":"subversion web interface","wesnoth-data":"A turn-based strategy game on a fantasy world (data files)","wgetpaste":"A script that automates pasting to a number of pastebin services","whaawmp":"GTK+ media player written in python and using GStreamer","when":"A simple commandline personal calendar program","widelands-data":"Widelands data files","wifi-radar":"A PyGTK2 utility for managing WiFi profiles","wine-mono":"Wine's built-in replacement for Microsoft's .NET Framework","winetricks":"Script to install various redistributable runtime libraries in Wine.","wiredtiger":"High performance, scalable, production quality, NoSQL, Open Source extensible platform for data management","wordpress":"Blog tool and publishing platform","words":"A collection of International 'words' files for \/usr\/share\/dict.","wqy-bitmapfont":"A bitmapped Song Ti (serif) Chinese font","wqy-microhei":"A Sans-Serif style high quality CJK outline font","wqy-microhei-lite":"The \"Light\" face of WenQuanYi Micro Hei font family","wqy-zenhei":"A Hei Ti Style (sans-serif) Chinese Outline Font.","wtf":"Acronym dictionary"}