{"zlib":"gzipとPKZIPにあるdeflate圧縮メソッドを実装した圧縮ライブラリ","zd1211-firmware":"Firmware for the in-kernel26 zd1211rw wireless driver","zeitgeist":"Service logging user activities and events","zenity":"Display graphical dialog boxes from shell scripts","zip":"Compressor\/archiver for creating and modifying zipfiles","zita-alsa-pcmi":"The successor of clalsadrv, provides easy access to ALSA PCM devices.","zita-resampler":"A C++ library for resampling audio signals","zopfli":"A compression library programmed in C to perform very good, but slow, deflate or zlib compression","zsh":"A very advanced and programmable command interpreter (shell) for UNIX","zsh-doc":"Info, HTML and PDF format of the ZSH documentation","zvbi":"VBI capture and decoding library","zziplib":"A lightweight library that offers the ability to easily extract data from files archived in a single zip file","zsnes":"スーパーファミコンエミュレータ","zanshin":"To-do management application for KDE based on Akonadi","zart":"A GUI for G'MIC real-time manipulations on the output of a webcam","zathura":"Minimalistic document viewer","zathura-cb":"Adds comic book support to zathura","zathura-djvu":"DjVu support for Zathura","zathura-pdf-mupdf":"PDF support for Zathura (MuPDF backend)","zathura-pdf-poppler":"Adds pdf support to zathura by using the poppler engine","zathura-ps":"Adds ps support to zathura by using the libspectre library","zaz":"Puzzle game where the player has to arrange balls in triplets","zbar":"Application and library for reading bar codes from various sources","zeromq":"Fast messaging system built on sockets. C and C++ bindings. aka 0MQ, ZMQ.","zh-autoconvert":"An intelligent Chinese Encoding converter","zile":"A small, fast, and powerful Emacs clone","zimg":"Scaling, colorspace conversion, and dithering library","zinnia":"Simple, customizable and portable online hand recognition system based on Support Vector Machines","ziproxy":"forwarding, non-caching, compressing HTTP proxy server","zita-convolver":"A fast, partitioned convolution engine library.","zmap":"Fast network scanner designed for Internet-wide network surveys","zn_poly":"Polynomial arithmetic over Z\/nZ","znc":"An IRC bouncer with modules & scripts support","zsync":"rsyncサーバーに接続できるファイル転送プログラム","zynaddsubfx":"無数の楽器を作ることができるOpensourceソフトウェアシンセサイザ","zaproxy":"Webアプリケーションの脆弱性を発見する統合侵入テストツール","zeitgeist-explorer":"低レベルで Zeitgeist'ログを監視および検査するためのグラフィカルインターフェイス","zim":"wikiのコンセプトをデスクトップにもたらすことを目指すWYSIWYGのテキストエディタ","zsh-completions":"Zshのための追加の補完定義","zsh-lovers":"Zsh のためのヒント、トリック、サンプルのコレクション","zsh-syntax-highlighting":"Zsh のためのFishシェルみたいなシンタックスハイライト","zshdb":"zsh スクリプトのデバッガ"}